let ary = [
    {
    "userName": "376990298zxcvb",
    "content": "真的很强大，音响效果也很好，想看什么就看什么，听音乐特别舒服，超级屏霸真的很好。我家里面的老电视以后都可以当成乐视电视看啦。",
    "evaluate": "80%",
    "time": "2017-06-03 15:02:19"
},
    {
        "userName": "1860xxx3815_223",
        "content": "系统主机和音箱一体的设计好，音响效果好，遥控器控制电视的功能很棒！功能很强大，也很人性化！就是宣传力度不够，很多人不知道，不了解！希望乐视的营销接接地气！",
        "evaluate": "75%",
        "time": "2017-05-07 10:04:33"
    },
    {
        "userName": "1860xxx3815_223",
        "content": "系统主机和音箱一体的设计好，音响效果好，遥控器控制电视的功能很棒！功能很强大，也很人性化！就是宣传力度不够，很多人不知道，不了解！希望乐视的营销接接地气！",
        "evaluate": "92%",
        "time": "2017-05-07 10:04:33"
    },
    {
        "userName": "乐视专家",
        "content": "老用户回馈，优惠购机，乐视不忘初心，点赞！早已到货，体验一段时间，声响饱满，系统桌面流畅，操作方便易用，精工品质，值得拥有！！！",
        "evaluate": "95%",
        "time": "2017-04-29 22:34:28"
    },
    {
        "userName": "贵州乐迷",
        "content": "挺好用，家里的大屏老电视直接变身先进的乐视电视，而且音响效果得到质的飞跃，满意",
        "evaluate": "63%",
        "time": "2017-04-15 18:54:50"
    },
    {
        "userName": "低调人氏",
        "content": "总算是给力了一次，这次这个还算不错，运行不卡，蓝牙可用，音效也还可以",
        "evaluate": "73%",
        "time": "2017-04-13 16:10:54"
    },
    {
        "userName": "湖南乐迷",
        "content": "播放高清网络视频、看体育比赛直播、享受到飞一般的流畅快感。超级电视流畅播放。展开了解超级电视性能找节目，查天气，搜明星，点歌曲……你想做的一切超级语音助理马上就能帮你获取。",
        "evaluate": "43%",
        "time": "2017-04-06 22:37:46"
    },
    {
        "userName": "云南乐迷",
        "content": "影响效果超棒，物超所值。",
        "evaluate": "53%",
        "time": "2017-04-06 22:37:46"
    },
    {
        "userName": "1384xxx9288_257",
        "content": "屏霸好！高清。看电影真是到了电影院。点赞。",
        "evaluate": "88%",
        "time": "2017-04-06 09:42:49"
    },
    {
        "userName": "哈里王子",
        "content": "音响效果超级棒！",
        "evaluate": "78%",
        "time": "2017-04-05 17:00:13"
    },
    {
        "userName": "1386xxx5065_180",
        "content": "真的很棒哦，尤其是声音！",
        "evaluate": "68%",
        "time": "2017-04-04 15:25:40"
    },
    {
        "userName": "顺乐",
        "content": "第一代超级电视的福利，存3年会员送的，直接把配置提高到第四代，相当合算。体检刚刚的。",
        "evaluate": "34%",
        "time": "2017-04-01 02:54:30"
    },
    {
        "userName": "别问大侠",
        "content": "非常不错，很好，值得信赖，下次一定再光顾。",
        "evaluate": "24%",
        "time": "2017-03-31 11:00:00"
    },
    {
        "userName": "月满空星夜",
        "content": "乐视屏霸感觉非常好，高.中.低音质也很饱满，质量也不捧，很喜欢“屏霸”。真的是好乐视产品！",
        "evaluate": "74%",
        "time": "2017-03-29 19:36:35"
    },
    {
        "userName": "不凡diy",
        "content": "功能强大音质好，值得购买！值得购买！值得购买！",
        "evaluate": "98%",
        "time": "2017-03-26 11:03:31"
    },
    {
        "userName": "kkx15505798",
        "content": "做工精致，硬件配置高运行速度快，系统操作简便，音响效果好。",
        "evaluate": "86%",
        "time": "2017-03-16 11:38:19"
    },
    {
        "userName": "wh2net",
        "content": "很好用，音效不错，值得拥有。",
        "evaluate": "70%",
        "time": "2017-02-26 07:52:06"
    },
    {
        "userName": "四川乐迷",
        "content": "大爱！乐视宣传少了，由于安装的原因请了维护人员上门安装。所有功能超级棒。估计使用惯了传统电视收看的，安装这个时代新产品要困难些，比如我。一直想买乐视电视机，又舍不得自己的三星。现在是二合一，超级满意，还买了台送朋友作礼物。缺点是，乐视商城的界面和客服软件太low了。",
        "evaluate": "75%",
        "time": "2018-04-26 12:20:58"
    },
    {
        "userName": "广东乐迷",
        "content": "快递态度极差",
        "evaluate": "78%",
        "time": "2017-12-30 11:39:47"
    },
    {
        "userName": "哈里王子",
        "content": "音响效果超级棒！",
        "evaluate": "78%",
        "time": "2017-04-05 17:00:13"
    },
    {
        "userName": "广东乐迷",
        "content": "快递态度极差",
        "evaluate": "78%",
        "time": "2017-12-30 11:39:47"
    },
    {
        "userName": "1386xxx5065_180",
        "content": "真的很棒哦，尤其是声音！",
        "evaluate": "68%",
        "time": "2017-04-04 15:25:40"
    },
    {
        "userName": "376990298zxcvb",
        "content": "真的很强大，音响效果也很好，想看什么就看什么，听音乐特别舒服，超级屏霸真的很好。我家里面的老电视以后都可以当成乐视电视看啦。",
        "evaluate": "80%",
        "time": "2017-06-03 15:02:19"
    },
    {
        "userName": "顺乐",
        "content": "第一代超级电视的福利，存3年会员送的，直接把配置提高到第四代，相当合算。体检刚刚的。",
        "evaluate": "34%",
        "time": "2017-04-01 02:54:30"
    },
    {
        "userName": "1860xxx3815_223",
        "content": "系统主机和音箱一体的设计好，音响效果好，遥控器控制电视的功能很棒！功能很强大，也很人性化！就是宣传力度不够，很多人不知道，不了解！希望乐视的营销接接地气！",
        "evaluate": "92%",
        "time": "2017-05-07 10:04:33"
    },
    {
        "userName": "别问大侠",
        "content": "非常不错，很好，值得信赖，下次一定再光顾。",
        "evaluate": "24%",
        "time": "2017-03-31 11:00:00"
    },
    {
        "userName": "贵州乐迷",
        "content": "挺好用，家里的大屏老电视直接变身先进的乐视电视，而且音响效果得到质的飞跃，满意",
        "evaluate": "63%",
        "time": "2017-04-15 18:54:50"
    },
    {
        "userName": "月满空星夜",
        "content": "乐视屏霸感觉非常好，高.中.低音质也很饱满，质量也不捧，很喜欢“屏霸”。真的是好乐视产品！",
        "evaluate": "74%",
        "time": "2017-03-29 19:36:35"
    },
    {
        "userName": "湖南乐迷",
        "content": "播放高清网络视频、看体育比赛直播、享受到飞一般的流畅快感。超级电视流畅播放。展开了解超级电视性能找节目，查天气，搜明星，点歌曲……你想做的一切超级语音助理马上就能帮你获取。",
        "evaluate": "43%",
        "time": "2017-04-06 22:37:46"
    },
    {
        "userName": "1384xxx9288_257",
        "content": "屏霸好！高清。看电影真是到了电影院。点赞。",
        "evaluate": "88%",
        "time": "2017-04-06 09:42:49"
    },
    {
        "userName": "四川乐迷",
        "content": "大爱！乐视宣传少了，由于安装的原因请了维护人员上门安装。所有功能超级棒。估计使用惯了传统电视收看的，安装这个时代新产品要困难些，比如我。一直想买乐视电视机，又舍不得自己的三星。现在是二合一，超级满意，还买了台送朋友作礼物。缺点是，乐视商城的界面和客服软件太low了。",
        "evaluate": "75%",
        "time": "2018-04-26 12:20:58"
    },
    {
        "userName": "wh2net",
        "content": "很好用，音效不错，值得拥有。",
        "evaluate": "70%",
        "time": "2017-02-26 07:52:06"
    },
    {
        "userName": "kkx15505798",
        "content": "做工精致，硬件配置高运行速度快，系统操作简便，音响效果好。",
        "evaluate": "86%",
        "time": "2017-03-16 11:38:19"
    },
    {
        "userName": "不凡diy",
        "content": "功能强大音质好，值得购买！值得购买！值得购买！",
        "evaluate": "98%",
        "time": "2017-03-26 11:03:31"
    },
    {
        "userName": "1860xxx3815_223",
        "content": "系统主机和音箱一体的设计好，音响效果好，遥控器控制电视的功能很棒！功能很强大，也很人性化！就是宣传力度不够，很多人不知道，不了解！希望乐视的营销接接地气！",
        "evaluate": "75%",
        "time": "2017-05-07 10:04:33"
    },
    {
        "userName": "云南乐迷",
        "content": "影响效果超棒，物超所值。",
        "evaluate": "53%",
        "time": "2017-04-06 22:37:46"
    },
    {
        "userName": "低调人氏",
        "content": "总算是给力了一次，这次这个还算不错，运行不卡，蓝牙可用，音效也还可以",
        "evaluate": "73%",
        "time": "2017-04-13 16:10:54"
    },
    {
        "userName": "乐视专家",
        "content": "老用户回馈，优惠购机，乐视不忘初心，点赞！早已到货，体验一段时间，声响饱满，系统桌面流畅，操作方便易用，精工品质，值得拥有！！！",
        "evaluate": "95%",
        "time": "2017-04-29 22:34:28"
    },
    {"userName":"哈里王子","content":"音响效果超级棒！","evaluate":"78%","time":"2017-04-05 17:00:13"},{"userName":"乐视专家","content":"老用户回馈，优惠购机，乐视不忘初心，点赞！早已到货，体验一段时间，声响饱满，系统桌面流畅，操作方便易用，精工品质，值得拥有！！！","evaluate":"95%","time":"2017-04-29 22:34:28"},{"userName":"广东乐迷","content":"快递态度极差","evaluate":"78%","time":"2017-12-30 11:39:47"},{"userName":"376990298zxcvb","content":"真的很强大，音响效果也很好，想看什么就看什么，听音乐特别舒服，超级屏霸真的很好。我家里面的老电视以后都可以当成乐视电视看啦。","evaluate":"80%","time":"2017-06-03 15:02:19"},{"userName":"1386xxx5065_180","content":"真的很棒哦，尤其是声音！","evaluate":"68%","time":"2017-04-04 15:25:40"},{"userName":"1860xxx3815_223","content":"系统主机和音箱一体的设计好，音响效果好，遥控器控制电视的功能很棒！功能很强大，也很人性化！就是宣传力度不够，很多人不知道，不了解！希望乐视的营销接接地气！","evaluate":"92%","time":"2017-05-07 10:04:33"},{"userName":"376990298zxcvb","content":"真的很强大，音响效果也很好，想看什么就看什么，听音乐特别舒服，超级屏霸真的很好。我家里面的老电视以后都可以当成乐视电视看啦。","evaluate":"80%","time":"2017-06-03 15:02:19"},{"userName":"贵州乐迷","content":"挺好用，家里的大屏老电视直接变身先进的乐视电视，而且音响效果得到质的飞跃，满意","evaluate":"63%","time":"2017-04-15 18:54:50"},{"userName":"顺乐","content":"第一代超级电视的福利，存3年会员送的，直接把配置提高到第四代，相当合算。体检刚刚的。","evaluate":"34%","time":"2017-04-01 02:54:30"},{"userName":"湖南乐迷","content":"播放高清网络视频、看体育比赛直播、享受到飞一般的流畅快感。超级电视流畅播放。展开了解超级电视性能找节目，查天气，搜明星，点歌曲……你想做的一切超级语音助理马上就能帮你获取。","evaluate":"43%","time":"2017-04-06 22:37:46"},{"userName":"1860xxx3815_223","content":"系统主机和音箱一体的设计好，音响效果好，遥控器控制电视的功能很棒！功能很强大，也很人性化！就是宣传力度不够，很多人不知道，不了解！希望乐视的营销接接地气！","evaluate":"92%","time":"2017-05-07 10:04:33"},{"userName":"1384xxx9288_257","content":"屏霸好！高清。看电影真是到了电影院。点赞。","evaluate":"88%","time":"2017-04-06 09:42:49"},{"userName":"别问大侠","content":"非常不错，很好，值得信赖，下次一定再光顾。","evaluate":"24%","time":"2017-03-31 11:00:00"},{"userName":"1386xxx5065_180","content":"真的很棒哦，尤其是声音！","evaluate":"68%","time":"2017-04-04 15:25:40"},{"userName":"贵州乐迷","content":"挺好用，家里的大屏老电视直接变身先进的乐视电视，而且音响效果得到质的飞跃，满意","evaluate":"63%","time":"2017-04-15 18:54:50"},{"userName":"别问大侠","content":"非常不错，很好，值得信赖，下次一定再光顾。","evaluate":"24%","time":"2017-03-31 11:00:00"},{"userName":"月满空星夜","content":"乐视屏霸感觉非常好，高.中.低音质也很饱满，质量也不捧，很喜欢“屏霸”。真的是好乐视产品！","evaluate":"74%","time":"2017-03-29 19:36:35"},{"userName":"不凡diy","content":"功能强大音质好，值得购买！值得购买！值得购买！","evaluate":"98%","time":"2017-03-26 11:03:31"},{"userName":"湖南乐迷","content":"播放高清网络视频、看体育比赛直播、享受到飞一般的流畅快感。超级电视流畅播放。展开了解超级电视性能找节目，查天气，搜明星，点歌曲……你想做的一切超级语音助理马上就能帮你获取。","evaluate":"43%","time":"2017-04-06 22:37:46"},{"userName":"wh2net","content":"很好用，音效不错，值得拥有。","evaluate":"70%","time":"2017-02-26 07:52:06"},{"userName":"1384xxx9288_257","content":"屏霸好！高清。看电影真是到了电影院。点赞。","evaluate":"88%","time":"2017-04-06 09:42:49"},{"userName":"广东乐迷","content":"快递态度极差","evaluate":"78%","time":"2017-12-30 11:39:47"},{"userName":"四川乐迷","content":"大爱！乐视宣传少了，由于安装的原因请了维护人员上门安装。所有功能超级棒。估计使用惯了传统电视收看的，安装这个时代新产品要困难些，比如我。一直想买乐视电视机，又舍不得自己的三星。现在是二合一，超级满意，还买了台送朋友作礼物。缺点是，乐视商城的界面和客服软件太low了。","evaluate":"75%","time":"2018-04-26 12:20:58"},{"userName":"乐视专家","content":"老用户回馈，优惠购机，乐视不忘初心，点赞！早已到货，体验一段时间，声响饱满，系统桌面流畅，操作方便易用，精工品质，值得拥有！！！","evaluate":"95%","time":"2017-04-29 22:34:28"},{"userName":"wh2net","content":"很好用，音效不错，值得拥有。","evaluate":"70%","time":"2017-02-26 07:52:06"},{"userName":"云南乐迷","content":"影响效果超棒，物超所值。","evaluate":"53%","time":"2017-04-06 22:37:46"},{"userName":"kkx15505798","content":"做工精致，硬件配置高运行速度快，系统操作简便，音响效果好。","evaluate":"86%","time":"2017-03-16 11:38:19"},{"userName":"顺乐","content":"第一代超级电视的福利，存3年会员送的，直接把配置提高到第四代，相当合算。体检刚刚的。","evaluate":"34%","time":"2017-04-01 02:54:30"},{"userName":"kkx15505798","content":"做工精致，硬件配置高运行速度快，系统操作简便，音响效果好。","evaluate":"86%","time":"2017-03-16 11:38:19"},{"userName":"低调人氏","content":"总算是给力了一次，这次这个还算不错，运行不卡，蓝牙可用，音效也还可以","evaluate":"73%","time":"2017-04-13 16:10:54"},{"userName":"云南乐迷","content":"影响效果超棒，物超所值。","evaluate":"53%","time":"2017-04-06 22:37:46"},{"userName":"1860xxx3815_223","content":"系统主机和音箱一体的设计好，音响效果好，遥控器控制电视的功能很棒！功能很强大，也很人性化！就是宣传力度不够，很多人不知道，不了解！希望乐视的营销接接地气！","evaluate":"75%","time":"2017-05-07 10:04:33"},{"userName":"不凡diy","content":"功能强大音质好，值得购买！值得购买！值得购买！","evaluate":"98%","time":"2017-03-26 11:03:31"},{"userName":"四川乐迷","content":"大爱！乐视宣传少了，由于安装的原因请了维护人员上门安装。所有功能超级棒。估计使用惯了传统电视收看的，安装这个时代新产品要困难些，比如我。一直想买乐视电视机，又舍不得自己的三星。现在是二合一，超级满意，还买了台送朋友作礼物。缺点是，乐视商城的界面和客服软件太low了。","evaluate":"75%","time":"2018-04-26 12:20:58"},{"userName":"月满空星夜","content":"乐视屏霸感觉非常好，高.中.低音质也很饱满，质量也不捧，很喜欢“屏霸”。真的是好乐视产品！","evaluate":"74%","time":"2017-03-29 19:36:35"},{"userName":"哈里王子","content":"音响效果超级棒！","evaluate":"78%","time":"2017-04-05 17:00:13"},{"userName":"低调人氏","content":"总算是给力了一次，这次这个还算不错，运行不卡，蓝牙可用，音效也还可以","evaluate":"73%","time":"2017-04-13 16:10:54"},{"userName":"1860xxx3815_223","content":"系统主机和音箱一体的设计好，音响效果好，遥控器控制电视的功能很棒！功能很强大，也很人性化！就是宣传力度不够，很多人不知道，不了解！希望乐视的营销接接地气！","evaluate":"75%","time":"2017-05-07 10:04:33"}
    ];

let result = JSON.parse(JSON.stringify(ary)).sort((a, b) => {
    return a.userName<b.userName;
});

console.log(result);
require('../utils/promiseFS').writeFile('./comment.json', result);

